In [43]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [44]:
import io
%cd "C:\Users\RIYAZROSHAN\Desktop"

C:\Users\RIYAZROSHAN\Desktop

In [45]:
hrtrain=pd.read_csv("train_LZdllcl.CSV")

In [46]:
hrtest=pd.read_csv("test_2umaH9m.CSV")

In [47]:
hrtest.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score
0,8724,Technology,region_26,Bachelor's,m,sourcing,1,24,NaN,1,1,0,77
1,74430,HR,region_4,Bachelor's,f,other,1,31,3.0,5,0,0,51
2,72255,Sales & Marketing,region_13,Bachelor's,m,other,1,31,1.0,4,0,0,47
3,38562,Procurement,region_2,Bachelor's,f,other,3,31,2.0,9,0,0,65
4,64486,Finance,region_29,Bachelor's,m,sourcing,1,30,4.0,7,0,0,61

In [48]:
hrtrain.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score,is_promoted
0,65438,Sales & Marketing,region_7,Master's & above,f,sourcing,1,35,5.0,8,1,0,49,0
1,65141,Operations,region_22,Bachelor's,m,other,1,30,5.0,4,0,0,60,0
2,7513,Sales & Marketing,region_19,Bachelor's,m,sourcing,1,34,3.0,7,0,0,50,0
3,2542,Sales & Marketing,region_23,Bachelor's,m,other,2,39,1.0,10,0,0,50,0
4,48945,Technology,region_26,Bachelor's,m,other,1,45,3.0,2,0,0,73,0

In [49]:
print(hrtrain.shape)
print(hrtest.shape)

(54808, 14)
(23490, 13)

In [50]:
hrtest.dtypes

employee_id               int64
department               object
region                   object
education                object
gender                   object
recruitment_channel      object
no_of_trainings           int64
age                       int64
previous_year_rating    float64
length_of_service         int64
KPIs_met >80%             int64
awards_won?               int64
avg_training_score        int64
dtype: object

In [51]:
hrtrain.dtypes

employee_id               int64
department               object
region                   object
education                object
gender                   object
recruitment_channel      object
no_of_trainings           int64
age                       int64
previous_year_rating    float64
length_of_service         int64
KPIs_met >80%             int64
awards_won?               int64
avg_training_score        int64
is_promoted               int64
dtype: object

In [52]:
hrtest['is_promoted']='test'

In [53]:
hrtest.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score,is_promoted
0,8724,Technology,region_26,Bachelor's,m,sourcing,1,24,NaN,1,1,0,77,test
1,74430,HR,region_4,Bachelor's,f,other,1,31,3.0,5,0,0,51,test
2,72255,Sales & Marketing,region_13,Bachelor's,m,other,1,31,1.0,4,0,0,47,test
3,38562,Procurement,region_2,Bachelor's,f,other,3,31,2.0,9,0,0,65,test
4,64486,Finance,region_29,Bachelor's,m,sourcing,1,30,4.0,7,0,0,61,test

In [54]:
hrtest.dtypes

employee_id               int64
department               object
region                   object
education                object
gender                   object
recruitment_channel      object
no_of_trainings           int64
age                       int64
previous_year_rating    float64
length_of_service         int64
KPIs_met >80%             int64
awards_won?               int64
avg_training_score        int64
is_promoted              object
dtype: object

In [55]:
combinedf=pd.concat([hrtrain,hrtest],axis=0)

In [56]:
combinedf.shape

(78298, 14)

In [57]:
combinedf.isnull().sum().sort_values(ascending = False)

previous_year_rating    5936
education               3443
employee_id                0
department                 0
region                     0
gender                     0
recruitment_channel        0
no_of_trainings            0
age                        0
length_of_service          0
KPIs_met >80%              0
awards_won?                0
avg_training_score         0
is_promoted                0
dtype: int64

In [58]:
combinedf.previous_year_rating.value_counts(dropna=False)

3.0    26539
5.0    16838
4.0    14126
1.0     8903
2.0     5956
NaN     5936
Name: previous_year_rating, dtype: int64

In [59]:
combinedf.previous_year_rating=combinedf.previous_year_rating.fillna(combinedf.previous_year_rating.value_counts().idxmax())

In [60]:
combinedf.education=combinedf.education.fillna(combinedf.education.value_counts().idxmax())

In [61]:
numericcols=combinedf.select_dtypes(include=np.number)
objectcols=combinedf.select_dtypes(include=['object'])

In [62]:
print(numericcols.shape)
print(objectcols.shape)

(78298, 8)
(78298, 6)

In [63]:
categorycols=numericcols[['previous_year_rating','KPIs_met >80%','awards_won?']]

In [64]:
numericcols=numericcols.drop(['previous_year_rating','KPIs_met >80%','awards_won?'],axis=1)

In [65]:
numericcols.shape

(78298, 5)

In [66]:
from sklearn.preprocessing import LabelEncoder

In [67]:
le=LabelEncoder()

In [68]:
numericcols.head()

   employee_id  no_of_trainings  age  length_of_service  avg_training_score
0        65438                1   35                  8                  49
1        65141                1   30                  4                  60
2         7513                1   34                  7                  50
3         2542                2   39                 10                  50
4        48945                1   45                  2                  73

In [69]:
objectcols.head()

,department,region,education,gender,recruitment_channel,is_promoted
0,Sales & Marketing,region_7,Master's & above,f,sourcing,0
1,Operations,region_22,Bachelor's,m,other,0
2,Sales & Marketing,region_19,Bachelor's,m,sourcing,0
3,Sales & Marketing,region_23,Bachelor's,m,other,0
4,Technology,region_26,Bachelor's,m,other,0

In [70]:
numericcols.tail()

,employee_id,no_of_trainings,age,length_of_service,avg_training_score
23485,53478,1,24,1,61
23486,25600,1,31,7,74
23487,45409,1,26,4,50
23488,1186,3,27,1,70
23489,5973,3,40,5,89

In [71]:
numericcols['is_promoted']=objectcols.is_promoted

objectcols.head()

In [73]:
numericcols.tail()

,employee_id,no_of_trainings,age,length_of_service,avg_training_score,is_promoted
23485,53478,1,24,1,61,test
23486,25600,1,31,7,74,test
23487,45409,1,26,4,50,test
23488,1186,3,27,1,70,test
23489,5973,3,40,5,89,test

In [74]:
objectcols=objectcols.drop('is_promoted',axis=1)

In [75]:
objectcolsdummy=objectcols.apply(le.fit_transform)

In [76]:
categorycolsdummy=categorycols.apply(le.fit_transform)

In [77]:
combinedfclean=pd.concat([numericcols,objectcolsdummy,categorycolsdummy],axis=1)

In [78]:
hrtraindf=combinedfclean[combinedfclean.is_promoted!='test']
hrtestdf=combinedfclean[combinedfclean.is_promoted=='test']

In [79]:
hrtestdf=hrtestdf.drop('is_promoted',axis=1)

In [80]:
promotedyes=hrtraindf[hrtraindf.is_promoted==1]
promotedno=hrtraindf[hrtraindf.is_promoted==0]

In [81]:
from scipy.stats import ttest_ind

In [82]:
ttest_ind(promotedyes.avg_training_score,promotedno.avg_training_score,equal_var=False)

Ttest_indResult(statistic=38.82675007357188, pvalue=7.662329172468838e-291)

In [86]:
hrtraindf.length_of_service.groupby(hrtraindf.is_promoted).mean()

is_promoted
0    5.879398
1    5.716367
Name: length_of_service, dtype: float64

In [90]:
hrtraindf.avg_training_score.groupby(hrtraindf.recruitment_channel).mean()

recruitment_channel
0    63.362839
1    66.182137
2    63.280620
Name: avg_training_score, dtype: float64

In [91]:
hrtrain.recruitment_channel.value_counts()

other       30446
sourcing    23220
referred     1142
Name: recruitment_channel, dtype: int64

In [93]:
other=hrtraindf[hrtraindf.recruitment_channel==0]
refer=hrtraindf[hrtraindf.recruitment_channel==1]
source=hrtraindf[hrtraindf.recruitment_channel==2]

In [94]:
from scipy.stats import f_oneway

In [96]:
f_oneway(other.avg_training_score,refer.avg_training_score,source.avg_training_score)

F_onewayResult(statistic=25.758203095600134, pvalue=6.585805990029605e-12)

In [97]:
f_oneway(other.length_of_service,refer.length_of_service,source.length_of_service)

F_onewayResult(statistic=25.31146884827052, pvalue=1.0290643395315436e-11)

In [98]:
pd.crosstab(hrtraindf.is_promoted,hrtraindf.recruitment_channel)

recruitment_channel      0     1      2
is_promoted
0                    27890  1004  21246
1                     2556   138   1974

In [99]:
from scipy.stats import chi2_contingency

In [114]:
chi2_contingency(pd.crosstab(hrtraindf.is_promoted,hrtraindf.recruitment_channel))

(19.23633518768639,
 6.650937825577018e-05,
 2,
 array([[27852.91271347,  1044.73580499, 21242.35148154],
        [ 2593.08728653,    97.26419501,  1977.64851846]]))

In [116]:
y = hrtraindf.is_promoted
X= hrtraindf.drop(['employee_id','is_promoted'], axis = 1)

In [122]:
from sklearn.linear_model import LogisticRegression
logit = LogisticRegression(max_iter=3000)

In [123]:
y = le.fit_transform(y)

In [124]:
logitmodel = logit.fit(X,y)

In [125]:
logitmodel.score(x,y)

0.9172018683403883

In [126]:
logitpredict=logitmodel.predict(x)

In [127]:
pd.crosstab(y,logitpredict)

col_0      0    1
row_0
0      49948  192
1       4346  322

In [128]:
from sklearn.metrics import classification_report

In [129]:
print(classification_report(y,logitpredict))

              precision    recall  f1-score   support

           0       0.92      1.00      0.96     50140
           1       0.63      0.07      0.12      4668

    accuracy                           0.92     54808
   macro avg       0.77      0.53      0.54     54808
weighted avg       0.89      0.92      0.89     54808